<template>
    <section class="topNav">
     <div class="back" @click="home">
      <ion-icon name="arrow-back-outline"></ion-icon>
     </div>
      <div class="name">Истисфара</div>
      <div></div>
     
    </section>
    <div class="farzlar">
      <div class="farz">
          <h2>Известные молитвы (истигъфар):</h2>
          <h3> 1. Известные молитвы (истигъфар):</h3>
          <p>Пророк (мир ему) сказал:</p>
          <p>Аллахумма анта роббий, ла илаха илла анта, холакатани ва ана ‘абдука, ва ана ‘аля ‘ахдика ва ва’дика мастата’ту, а’узу бика мин шарри ма сана’ту, абу’у лака бини’матика ‘алaйя ва абу’у бизамби, фагъфир лий, фа-иннаху ла ягъфируз-зунуба илла анта."</p> <hr>
          <p>«Кто произнесёт эту молитву вечером и умрёт до утра, тот войдёт в Рай. Кто произнесёт её утром и умрёт до вечера, тот тоже войдёт в Рай.»</p> <br>
          <p>"Аллахумма анта роббий, ла илаха илла анта, холакатани ва ана ‘абдука, ва ана ‘аля ‘ахдика ва ва’дика мастата’ту, а’узу бика мин шарри ма сана’ту, абу’у лака бини’матика ‘алaйя ва абу’у бизамби, фагъфир лий, фа-иннаху ла ягъфируз-зунуба илла анта."</p> <hr>
          <p>«О Аллах, Ты мой Господь, нет божества, кроме Тебя. Ты создал меня, а я — Твой раб. Насколько могу, я держусь обещания, данного Тебе, и боюсь наказания за содеянное. Я ищу прибежища у Тебя от зла своих деяний. Признаю Твои милости ко мне и свои грехи перед Тобой. Прости меня, ибо никто не прощает грехи, кроме Тебя.»</p>
      </div>
      <div class="farz">
          <h2>2.Простая молитва о прощении:</h2>
          <p>"Астагфируллаха робби мин кулли замбин ва атубу илайх."</p> <hr>
          <p> «Я прошу прощения у моего Господа Аллаха за все мои грехи и каюсь перед Ним.»</p>
      </div>
      <div class="farz">
          <h2>3.Короткая форма истигъфара:</h2>
          <p>"Астагфируллах, астагфируллах, астагфируллах."</p> <hr>
          <p> «Прошу прощения у Аллаха.»</p> 
      </div>
      <div class="farz">
          <h2>4.Молитва покаяния:</h2>
          <p>"Раббана золамна анфусана ва ин лам тагъфир лана ва тархамна ланаку нанна мина-ль-хосирин."</p> <hr>
          <p> «Господь наш! Мы поступили несправедливо по отношению к самим себе. Если Ты не простишь нас и не помилуешь нас, то мы окажемся в числе потерпевших убыток.»</p>
      </div>
      
    </div>
  </template>
  
  <script>
  export default {
      methods:{
          home(){
              this.$router.push('/');
          }
      },
      
  }
  </script>
  
  <style scoped>
  *{
      margin: 0;
      padding: 0;box-sizing: border-box;
  }
  .topNav{
      padding: 0 2vw 0 2vw;
  height: 6vh;
  width: 100vw;
  display: flex;
  justify-content: space-between;
  /* background-color: #c48080; */
  align-items: center;
  font-size: 30px;
  /* position: fixed; */
  }
  .back{
      display: flex !important;
      align-items: center;
      font-weight: 400;
  }.name{
      font-weight: 300;
  }
  .farzlar{
      margin: 2vh 0;
      display: flex;
      flex-direction: column;
      width: 100vw;
      padding: 0 2vw;
      gap: 2vh;
  }
  .farz{
      display: flex;
      flex-direction: column;
      gap: 1vh;
  }
  .farz p{
      font-size: 23px;
      text-align: center;
      color: rgba(77, 47, 3, 0.863);
      font-weight: 500;
  }
  .farz h2{
      color: rgb(12, 102, 32);
  }
  </style>